Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/educational_supports/visiting_teacher_service_for_children_with_visual_impairments_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: The Inclusion Support Service (which is part of the National Council of Special Education) operates Visiting Teacher Service for deaf or hard-of-hearing children and children with visual impairments
ga: Oibríonn an tSeirbhís Tacaíochta Cuimsithe (atá mar chuid den Chomhairle Náisiúnta um Oideachas Speisialta) Seirbhís na Múinteoirí Cuartaíochta le haghaidh leanaí bodhra nó lagéisteachta agus leanaí ar a bhfuil lagú amhairc

source: Specially trained teachers provide the service. Visiting teachers aim to be a support to both the parents or guardian and the child
ga: Bíonn sé mar aidhm ag múinteoirí cuartaíochta a bheith ina dtaca do na tuismitheoirí nó do na caomhnóirí agus don leanbh féin

source: The support service can begin shortly following the birth of the child and continue through primary and post-primary education where appropriate
ga: Féadtar tús a chur leis an tseirbhís tacaíochta go gairid i ndiaidh go mbeirtear ar an leanbh agus féadfaidh sí leanúint tríd an oideachas bunscoile agus iar-bhunscoil, sa chás gur cuí

source: In addition, the teachers provide a teaching service for the pre-school child in the home if considered necessary
ga: Ina cheann sin, soláthraíonn na múinteoirí seirbhís mhúinteoireachta sa bhaile i gcomhair an pháiste réamhscoile, má cheaptar í a bheith riachtanach

source: Each teacher has responsibility for a particular region and travels to meet the children, parents or guardians, teachers, care staff and other professionals involved with the child as necessary
ga: Bíonn freagracht ag gach múinteoir ar leith ar son réigiún áirithe agus taistlíonn siad, de réir mar is gá, chun bualadh leis na páistí, leis na tuismitheoirí nó leis na caomhnóirí, leis an bhfoireann cúraim agus le daoine gairmiúla eile a mbíonn baint acu leis an bpáiste

source: No child is too young to be referred to the visiting teacher service
ga: Ní bhíonn aon pháiste ann a meastar fúthu gur ró-óg iad lena n-atreorú chuig an tseirbhís mhúinteora ar cuairt

source: The Visiting Teacher Service is free of charge
ga: Is go hiomlán saor in aisce ó aon táille í an tseirbhís seo

source: Visiting teachers for visually impaired children
ga: Múinteoirí cuartaíochta do leanaí lagamhairc

source: Visiting teachers assess and evaluate the needs of each child and explain the effects of visual impairment, including the current and future implications of the impairment
ga: Déanann múinteoirí cuartaíochta measúnú agus measúnacht ar riachtanais gach linbh agus míníonn siad na héifeachtaí atá ag an lagamharc, lena n-áirítear impleachtaí láithreacha agus todhchaí an lagamhairc

source: In addition, they provide information and advice to assess educational planning for children and young people with visual impairments
ga: Ina theannta sin, soláthraíonn siad faisnéis agus comhairle chun measúnú a dhéanamh ar phleanáil oideachais do leanaí agus do dhaoine óga lagamhairc

source: Visiting teachers co-operate closely with colleagues from a range of educational and other professional backgrounds, in addition to national organisations
ga: Comh-oibríonn múinteoirí cuartaíochta go dlúth le comhghleacaithe a bhfuil réimse cúlraí oideachais agus gairmiúla eile acu, chomh maith le heagraíochtaí náisiúnta

source: Visiting teachers advise schools (including pre-schools) regarding suitable teaching methods and classroom management strategies to support pupils with visual impairments in mainstream schools
ga: Tugann múinteoirí cuartaíochta comhairle do scoileanna (lena n-áirítear réamhscoileanna) maidir le modhanna múinteoireachta oiriúnacha agus straitéisí chun an seomra ranga a bhainistiú chun tacú le daltaí lagamhairc i scoileanna príomhshrutha

source: They conduct assessments and give advice in relation to equipment commonly used by people who are visually impaired and advice on additional personnel resources, when needed
ga: Déanann siad measúnachtaí agus tugann siad comhairle i ndáil le trealamh a úsáideann daoine lagamhairc go coitianta i

source: Teachers can also advise schools on any necessary adaptations to the school environment required by the child with visual impairment
ga: teicneolaíocht, cló mór, téipeanna agus comhairle maidir le hacmhainní breise pearsanra nuair is gá sin

source: Visiting teachers for deaf children
ga: Múinteoirí cuartaíochta do leanaí bodhra

source: Visiting teachers work with pre-school children to provide guidance and support for parents of deaf or hard-of-hearing children
ga: Oibríonn múinteoirí cuartaíochta le leanaí réamhscoile chun treoir agus tacaíocht a sholáthar do thuismitheoirí ag a bhfuil leanaí bodhra nó leanaí lagéisteachta

source: They inform parents of the implications of deafness for the acquisition of spoken language and Irish Sign Language (ISL), inform parents of communication methods and liaise with audiology services
ga: Cuireann siad in iúl do thuismitheoirí cé na himpleachtaí atá ag an mbodhaire maidir leis an teanga labhartha a shealbhú agus Teanga Chomharthaíochta na hÉireann (TCÉ), cuireann siad modhanna cumarsáide in iúl do thuismitheoirí agus déanann siad idirchaidreamh le seirbhísí éisteolaíochta

source: Applications for home tuition in sign language should be made to the visiting teacher
ga: Ba chóir iarratas ar theagasc sa bhaile sa teanga chomharthaíochta a dhéanamh chuig an múinteoir cuartaíochta

source: Visiting teachers also monitor the child’s language development and communication skills and give information and advice to parents on pre-school and school placements
ga: Déanann múinteoirí cuartaíochta faireachán freisin ar fhorbairt teanga an linbh agus ar a scileanna cumarsáide agus tugann siad faisnéis agus comhairle do thuismitheoirí maidir le socrúcháin réamhscoile agus scoile

source: At primary level the visiting teacher works with the principal and other staff to plan and put in place suitable supports for the child
ga: Ag leibhéal na bunscoile, oibríonn an múinteoir cuartaíochta leis an bpríomhoide agus le daoine eile den fhoireann chun tacaíochtaí oiriúnacha don leanbh a phleanáil agus a chur ar bun

source: They can provide tuition with special emphasis on language development and monitor the educational progress of the child
ga: Is féidir leo teagasc a sholáthar a leagann béim speisialta ar fhorbairt teanga agus faireachán a dhéanamh ar dhul chun cinn an linbh ó thaobh an oideachais de

source: Training in assistive technologies and mobility
ga: Oiliúint sna teicneolaíochtaí cúnta agus sa tsoghluaisteacht

source: Visiting teachers can refer children for assessment of low-vision aids and then train the children in their use
ga: Féadann múinteoirí cuartaíochta páistí a atreorú le haghaidh measúnú ar áiseanna lagamhairc, agus na páistí a oiliúint ansin lena leas a bhaint astu

source: They help children develop tactile and other sensory skills and give advice on self-help skills and other skills needed for independent living
ga: Cuidíonn siad le páistí scileanna tadhlacha agus scileanna na gcéadfaí eile a fhorbairt, agus tugann siad comhairle ar scileanna féinchabhrach agus ar scileanna eile a bhíonn de dhíth orthu chun saol neamhspleách a chaitheamh

source: They provide support in the development of pre-Braille skills where necessary and give some instruction in mobility where appropriate
ga: Cuireann siad tacaíocht ar fáil i scileanna réamh-Braille a fhorbairt sa chás gur gá agus tugann siad roinnt treorú maidir le soghluaisteacht nuair is cuí

source: Teachers can also refer the child for further mobility instruction where required
ga: Féadann na múinteoirí an páiste a atreorú i gcomhair bhreis teagaisc sa tsoghluaisteacht sa chás ar riachtanach é

source: You can read more about mobility training for visually impaired people here
ga: Is féidir leat tuilleadh eolais a léamh faoi oiliúint na soghluaisteachta do dhaoine lagamhairc anseo

source: Visiting teachers evaluate the acoustic environment for a deaf or hard-of-hearing child and help them manage audiology equipment
ga: Déanann múinteoirí ar cuairt meastóireacht ar an timpeallacht fhuaimiúil do pháiste bodhra nó lagéisteachta agus cuidíonn siad leo triail a bhaint as trealamh éisteolaíochta

source: Find out more about assistive technologies on the Assist Ireland website
ga: Faigh tuilleadh eolais mar gheall ar theicneolaícht chúnta ar an suíomh Assist Ireland

source: Referring a child to the Visiting Teacher Service
ga: Ag atreorú páiste chuig an tseirbhís mhúinteoir cuartaíochta

source: Before a child may use the Visiting Teacher Service, they must be referred for assessment by the service
ga: Sular féidir le páiste a bheith rannpháirteach sa tseirbhís mhúinteoir cuartaíochta, caithfidh an tseirbhís mhúinteoir cuartaíochta iad a atreorú le haghaidh measúnú

source: Referrals may be requested by:
ga: Is féidir leis na grúpaí seo a leanas atreoruithe a iarraidh:

source: • The Health Service Executive audiological and ophthalmology services
ga: • Feidhmeannacht na Seirbhíse Sláinte

source: • National Council for Special Education
ga: • An Chomhairle Náisiúnta um Oideachas Speisialta

source: For visually impaired children
ga: Le haghaidh páistí le lagú amhairc

source: • The National Council for the Blind of Ireland
ga: • Comhairle Náisiúnta na hÉireann do na Daill

source: For deaf or hard-of-hearing children
ga: Le haghaidh páistí bodhra nó lagéisteachta

source: • The Cochlear Implant Unit, Beaumont Hospital
ga: • Ionad Ionchlannáin Cochlear, Ospidéal Beaumont

source: Any health professional who wishes to refer a child should first discuss their concerns fully with the child's parents
ga: Ba cheart tuairisc ón oftailmeolaí a bheith le gach atreorú don tseirbhís le haghaidh páistí le lagú amhairc

source: All referrals to the service for chldren must be accompanied by an audiologist's or ophthalmologist's report
ga: Scrúdóidh oftailmeolaí súile do pháiste chun fáthmheas a dhéanamh ar fhadhbanna amhairc agus ar ghalair súile

source: The Visiting Teacher Service also accepts referrals regarding children where the visual impairment or deafness is the compounding rather than the major disabling condition
ga: Anuas air sin, glacann Seirbhís na Múinteoirí Cuartaíochta le hatreoruithe maidir le leanaí sa chás gurb é an lagú amhairc nó an bhodhaire an riocht ilghnéitheach seachas an riocht is mó a bhíonn ina chúis leis an míchumas

source: There is no charge for an assessment or to avail of the Visiting Teacher Service
ga: Ní ghearrtar aon táille ar mheasúnú ná chun an tSeirbhís Mhúinteoir Cuartaíochta a fháil

source: The service is open to all children living in Ireland
ga: Tá an tseirbhís ar fáil do gach uile pháiste a chónaíonn in Éirinn

source: You do not have to fulfill any residence requirements to avail of the service (that is, you do not have to be living in the State for a certain period)
ga: Ní bhíonn ort aon riachtanais chónaithe a chomhlíonadh chun an tseirbhís a fháil (.i. ní chaithfidh tú a bheith i do chónaí sa Stát ar feadh tréimhse áirithe)

source: Before a child may be referred for assessment by the Visiting Teacher Service, you must complete an application form for the Visiting Teacher Service
ga: Ní mór duit foirm iarratais a líonadh isteach sula bhféadann an tSeirbhís Mhúinteoir Cuartaíochta páiste a atreorú le haghaidh measúnú

source: Referral applications should be sent directly to the local visiting teacher
ga: Ba cheart iarratais ar atreorú a sheoladh go díreach chuig an múinteoir áitiúil cuartaíochta
